#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
<pre>terraform
module.thadmin_routing.module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:627002765486:certificate/565d3a00-d047-48f2-956a-aed08dd6956b]
module.thadmin_routing.module.cloudfront.aws_cloudfront_origin_access_identity.this["s3_bucket"]: Refreshing state... [id=E3JOC36ODMBL65]
module.thadmin_hosting.aws_s3_bucket.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.acm.aws_route53_record.validation["thadmin-staging.technicie.nl"]: Refreshing state... [id=Z3I4ZHBBD5NSHU__f4c1968cf0da5157d0f46ed63ecf426e.thadmin-staging.technicie.nl._CNAME]
module.thadmin_routing.module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2022-03-15 04:55:50.004 +0000 UTC]
module.thadmin_hosting.aws_s3_bucket_acl.this: Refreshing state... [id=thalia-thadmin-staging,private]
module.thadmin_hosting.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2ZP8HCBLISQFN]
module.thadmin_routing.aws_route53_record.api: Refreshing state... [id=Z3I4ZHBBD5NSHU_thadmin-staging_A]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-750-1334.jpg"]: Refreshing state... [id=apple-splash-750-1334.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["img/anonymousUser.c7a94bce.jpg"]: Refreshing state... [id=img/anonymousUser.c7a94bce.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["browserconfig.xml"]: Refreshing state... [id=browserconfig.xml]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-144x144.png"]: Refreshing state... [id=mstile-144x144.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1620-2160.jpg"]: Refreshing state... [id=apple-splash-1620-2160.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2388.jpg"]: Refreshing state... [id=apple-splash-1668-2388.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["css/chunk-vendors.0833f3cd.css"]: Refreshing state... [id=css/chunk-vendors.0833f3cd.css]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.0a65b0d6.js.map"]: Refreshing state... [id=js/chunk-vendors-legacy.0a65b0d6.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2688.jpg"]: Refreshing state... [id=apple-splash-1242-2688.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x150.png"]: Refreshing state... [id=mstile-310x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2732-2048.jpg"]: Refreshing state... [id=apple-splash-2732-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1334-750.jpg"]: Refreshing state... [id=apple-splash-1334-750.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/525.dd1ac814.js.map"]: Refreshing state... [id=js/525.dd1ac814.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2208-1242.jpg"]: Refreshing state... [id=apple-splash-2208-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1170-2532.jpg"]: Refreshing state... [id=apple-splash-1170-2532.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"]: Refreshing state... [id=img/backgroundImage.24f22a44.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-150x150.png"]: Refreshing state... [id=mstile-150x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-828-1792.jpg"]: Refreshing state... [id=apple-splash-828-1792.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["site.webmanifest"]: Refreshing state... [id=site.webmanifest]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1125-2436.jpg"]: Refreshing state... [id=apple-splash-1125-2436.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1536-2048.jpg"]: Refreshing state... [id=apple-splash-1536-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.ce00a3ba.js.map"]: Refreshing state... [id=js/app-legacy.ce00a3ba.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-touch-icon.png"]: Refreshing state... [id=apple-touch-icon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2224-1668.jpg"]: Refreshing state... [id=apple-splash-2224-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2388-1668.jpg"]: Refreshing state... [id=apple-splash-2388-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2688-1242.jpg"]: Refreshing state... [id=apple-splash-2688-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["safari-pinned-tab.svg"]: Refreshing state... [id=safari-pinned-tab.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2160-1620.jpg"]: Refreshing state... [id=apple-splash-2160-1620.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.0a65b0d6.js"]: Refreshing state... [id=js/chunk-vendors-legacy.0a65b0d6.js]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.391b09bb.js"]: Refreshing state... [id=js/chunk-vendors.391b09bb.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-640-1136.jpg"]: Refreshing state... [id=apple-splash-640-1136.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2778-1284.jpg"]: Refreshing state... [id=apple-splash-2778-1284.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-70x70.png"]: Refreshing state... [id=mstile-70x70.png]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.ce00a3ba.js"]: Refreshing state... [id=js/app-legacy.ce00a3ba.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1284-2778.jpg"]: Refreshing state... [id=apple-splash-1284-2778.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["css/app.e7814388.css"]: Refreshing state... [id=css/app.e7814388.css]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1136-640.jpg"]: Refreshing state... [id=apple-splash-1136-640.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/525-legacy.356281cc.js"]: Refreshing state... [id=js/525-legacy.356281cc.js]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.391b09bb.js.map"]: Refreshing state... [id=js/chunk-vendors.391b09bb.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2436-1125.jpg"]: Refreshing state... [id=apple-splash-2436-1125.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["index.html"]: Refreshing state... [id=index.html]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2224.jpg"]: Refreshing state... [id=apple-splash-1668-2224.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1792-828.jpg"]: Refreshing state... [id=apple-splash-1792-828.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2532-1170.jpg"]: Refreshing state... [id=apple-splash-2532-1170.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2208.jpg"]: Refreshing state... [id=apple-splash-1242-2208.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.svg"]: Refreshing state... [id=favicon.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.png"]: Refreshing state... [id=favicon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-1536.jpg"]: Refreshing state... [id=apple-splash-2048-1536.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-512x512.png"]: Refreshing state... [id=android-chrome-512x512.png]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.7f0c27a6.js"]: Refreshing state... [id=js/app.7f0c27a6.js]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x310.png"]: Refreshing state... [id=mstile-310x310.png]
module.thadmin_hosting.aws_s3_object.code_build_object["js/525.dd1ac814.js"]: Refreshing state... [id=js/525.dd1ac814.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-2732.jpg"]: Refreshing state... [id=apple-splash-2048-2732.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.7f0c27a6.js.map"]: Refreshing state... [id=js/app.7f0c27a6.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-192x192.png"]: Refreshing state... [id=android-chrome-192x192.png]
module.thadmin_hosting.aws_s3_object.code_build_object["js/525-legacy.356281cc.js.map"]: Refreshing state... [id=js/525-legacy.356281cc.js.map]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag               = "407e69540c950ce3e893be2cbadd0f30-2" -> "5f59aad8b5eddf226c7e5a21939e4018"
        id                 = "img/backgroundImage.24f22a44.jpg"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag               = "f3a04dc3e425e3de74d05522c7fa324f" -> "86a30840a378d53c5b79405ec31970ab"
        id                 = "index.html"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525-legacy.356281cc.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "1fa8fbed359f8bb407e43e0caf280b02" -> null
      - force_destroy      = false -> null
      - id                 = "js/525-legacy.356281cc.js" -> null
      - key                = "js/525-legacy.356281cc.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525-legacy.356281cc.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525-legacy.356281cc.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "16d398711a1c8a704a22ed2a07e4c3e3" -> null
      - force_destroy      = false -> null
      - id                 = "js/525-legacy.356281cc.js.map" -> null
      - key                = "js/525-legacy.356281cc.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525-legacy.356281cc.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525-legacy.7b684f22.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "391afe8dc02135ee200260361c88e0dd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/525-legacy.7b684f22.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525-legacy.7b684f22.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525-legacy.7b684f22.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "4a5e7b419e3683d1820b11d037d1ac36"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/525-legacy.7b684f22.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525-legacy.7b684f22.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525.dd1ac814.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "47775af924d374d7ef5bb7ea3e778076" -> null
      - force_destroy      = false -> null
      - id                 = "js/525.dd1ac814.js" -> null
      - key                = "js/525.dd1ac814.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525.dd1ac814.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525.dd1ac814.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "3c19eba268967d7f58729db2f4463d9c" -> null
      - force_destroy      = false -> null
      - id                 = "js/525.dd1ac814.js.map" -> null
      - key                = "js/525.dd1ac814.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525.dd1ac814.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525.ed99a1ce.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "4fca4059eb56757d9616329b657723a6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/525.ed99a1ce.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525.ed99a1ce.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/525.ed99a1ce.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "12e54699c35e63bbd14c44ccb2110f4f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/525.ed99a1ce.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/525.ed99a1ce.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.b8bc9ca7.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "d7ad2a15a353c34dd5b35538200c71d3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app-legacy.b8bc9ca7.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.b8bc9ca7.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.b8bc9ca7.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "74cf02cfbe96b1d57a46e7be6b6d7ba2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app-legacy.b8bc9ca7.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.b8bc9ca7.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.ce00a3ba.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "d2377c0a30b07ac9f94ab4ce62c5e79b" -> null
      - force_destroy      = false -> null
      - id                 = "js/app-legacy.ce00a3ba.js" -> null
      - key                = "js/app-legacy.ce00a3ba.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.ce00a3ba.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app-legacy.ce00a3ba.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "51c04d283b0bcb7b75ecce131d59782f" -> null
      - force_destroy      = false -> null
      - id                 = "js/app-legacy.ce00a3ba.js.map" -> null
      - key                = "js/app-legacy.ce00a3ba.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app-legacy.ce00a3ba.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.7f0c27a6.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "77a3ed5918e289fe1ae0a400562039ee" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.7f0c27a6.js" -> null
      - key                = "js/app.7f0c27a6.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.7f0c27a6.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.7f0c27a6.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "5078f301b8bc6861703e04fea90a27eb" -> null
      - force_destroy      = false -> null
      - id                 = "js/app.7f0c27a6.js.map" -> null
      - key                = "js/app.7f0c27a6.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.7f0c27a6.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.81790637.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "5d4a38e632753e75822cbeb119432b34"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.81790637.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.81790637.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.81790637.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "c2673561b6e65843442d8f790ecbf174"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.81790637.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.81790637.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.0a65b0d6.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "d10249ca2f48fc44db251ced1b568c2c" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors-legacy.0a65b0d6.js" -> null
      - key                = "js/chunk-vendors-legacy.0a65b0d6.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.0a65b0d6.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.0a65b0d6.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "f5e65fa179a8c151a77d676351488e11" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors-legacy.0a65b0d6.js.map" -> null
      - key                = "js/chunk-vendors-legacy.0a65b0d6.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.0a65b0d6.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.84101680.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "f020623240694c79631255174955d1d8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors-legacy.84101680.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.84101680.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors-legacy.84101680.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "008c45c289c19c63e0d4b0db808eb04e"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors-legacy.84101680.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors-legacy.84101680.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.391b09bb.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "text/javascript" -> null
      - etag               = "2c78bf39849bcad399f84d117ee2fb9f" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors.391b09bb.js" -> null
      - key                = "js/chunk-vendors.391b09bb.js" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.391b09bb.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.391b09bb.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - acl                = "private" -> null
      - bucket             = "thalia-thadmin-staging" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "application/octet-stream" -> null
      - etag               = "98814543bb085198ffa2f5af0b1c23a8" -> null
      - force_destroy      = false -> null
      - id                 = "js/chunk-vendors.391b09bb.js.map" -> null
      - key                = "js/chunk-vendors.391b09bb.js.map" -> null
      - metadata           = {} -> null
      - source             = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.391b09bb.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.3b777d0e.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "4e85ee3b1448d12eeec07c0ffdcd7d46"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.3b777d0e.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.3b777d0e.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.3b777d0e.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + acl                    = "private"
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "a4b62f0d36e6dbf009a27f11a79c8d3c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.3b777d0e.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.3b777d0e.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 12 to add, 2 to change, 12 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "aws_profile" but a value
was found in file "terraform.tfvars". To use this value, add a "variable"
block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

</pre>
</details>